<?php
/**
 * очистка текста от html (заменяет на сущности)
 * @param string $text
 * @return string
 */
function esc_html($text){
	return htmlspecialchars((string)$text, ENT_NOQUOTES|ENT_SUBSTITUTE|ENT_HTML401, 'UTF-8', 0);
}

/**
 * очистка текста от html (удаляет теги)
 * @param string $text
 * @return string
 */
function del_html($text){
	return esc_html(strip_tags((string)$text));
}

/**
 * очистка текста от html (заменяет на сущности) для вставки в атрибут тега
 * @param string $text
 * @return string
 */
function esc_attr($text){
	return htmlspecialchars((string)$text, ENT_QUOTES|ENT_SUBSTITUTE|ENT_HTML401, 'UTF-8', 0);
}

/**
 * очистка текста от html (удаляет теги) для вставки в атрибут тега
 * @param string $text
 * @return string
 */
function del_attr($text){
	return esc_attr(strip_tags((string)$text));
}

/**
 * @param string $filename
 * @return false|string
 */
function filename_clear($filename){
	$filename = translit($filename);
	$filename = str_replace([' ', '\\', '/'], ['-', '.', '.'], $filename);
	$c_filename = preg_replace("#[^a-zA-Z0-9._!@=\#~%^&'()\\[\\]{};,\-]#u", '', $filename);
	$c_filename = trim($c_filename, '.-_');
	return $c_filename !== $filename || mb_strlen($c_filename) > 255 ? false : $c_filename;
}

function translit($str){
	$converter = [
		'а'  => 'a',   'ӓ' => 'a',    'ӑ' => 'a',    'ӕ' => 'ae',
		'б'  => 'b',   'в' => 'v',    'г' => 'g',    'ѓ' => 'g',
		'ғ'  => 'g',   'ҕ' => 'g',    'һ' => 'h',    'д' => 'd',
		'ђ'  => 'd',   'е' => 'e',    'ӗ' => 'yo',   'ё' => 'yo',
		'є'  => 'yo',  'ж' => 'j',    'җ' => 'j',    'ӝ' => 'j',
		'ӂ'  => 'j',   'з' => 'z',    'ӟ' => 'z',    'ӡ' => 'z',
		'ѕ'  => 'z',   'и' => 'i',    'ӣ' => 'y',    'ӥ' => 'y',
		'й'  => 'y',   'і' => 'i',    'ї' => 'i',    'ј' => 'j',
		'к'  => 'k',   'ќ' => 'k',    'ӄ' => 'k',    'ҝ' => 'k',
		'ҡ'  => 'k',   'ҟ' => 'k',    'қ' => 'k',    'ԛ' => 'q',
		'л'  => 'l',   'љ' => 'l',    'ԡ' => 'l',    'м' => 'm',
		'н'  => 'n',   'њ' => 'n',    'ң' => 'n',    'ӊ' => 'n',
		'ҥ'  => 'n',   'ԋ' => 'n',    'ԣ' => 'n',    'ӈ' => 'n',
		'о'  => 'o',   'ӧ' => 'o',    'ө' => 'o',    'ӫ' => 'o',
		'ҩ'  => 'o',   'œ' => 'o',    'п' => 'p',    'ҧ' => 'p',
		'ԥ'  => 'p',   'р' => 'r',    'с' => 's',    'ҫ' => 's',
		'т'  => 't',   'ћ' => 'c',    'ԏ' => 't',    'ҭ' => 't',
		'у'  => 'u',   'ӱ' => 'u',    'ӯ' => 'u',    'ў' => 'u',
		'ӳ'  => 'u',   'ү' => 'u',    'ұ' => 'u',    'ӏ' => 'l',
		'ԝ'  => 'w',   'ф' => 'f',    'х' => 'h',    'ҳ' => 'h',
		'ц'  => 'c',   'ҵ' => 'c',    'џ' => 'd',    'ч' => 'ch',
		'ҷ'  => 'ch',  'ӌ' => 'ch',   'ӵ' => 'ch',   'ҹ' => 'ch',
		'ҽ'  => 'c',   'ҿ' => 'c',    'ш' => 'sh',   'щ' => 'sch',
		'ъ'  => '',    'ы' => 'y',    'ӹ' => 'y',    'ь' => '',
		'э'  => 'e',   'ә' => 'a',    'ӛ' => 'a',    'ю' => 'yu',
		'я'  => 'ya',  'ґ' => 'g',    'ѣ' => 'e',    'ѫ' => 'a',
		'ѳ'  => 'f',   'ѵ' => 'y',
		
		'α' => 'a',    'ά' => 'a',    'β' => 'v',    'γ' => 'g',
		'δ' => 'd',    'ε' => 'e',    'έ' => 'e',    'ζ' => 'z',
		'η' => 'i',    'ή' => 'i',    'θ' => 'th',   'ι' => 'i',
		'ί' => 'i',    'ϊ' => 'i',    'κ' => 'k',    'λ' => 'l',
		'μ' => 'm',    'ν' => 'n',    'ξ' => 'x',    'ο' => 'o',
		'ό' => 'o',    'π' => 'p',    'ρ' => 'r',    'σ' => 's',
		'ς' => 's',    'τ' => 't',    'υ' => 'y',    'ύ' => 'y',
		'ϋ' => 'y',    'φ' => 'f',    'χ' => 'ch',   'ψ' => 'ps',
		'ω' => 'o',    'ώ' => 'o',
		
		'А' => 'A',    'Ӓ' => 'A',    'Ӑ' => 'A',    'Ӕ' => 'AE',
		'Б' => 'B',    'В' => 'V',    'Г' => 'G',    'Ѓ' => 'G',
		'Ғ' => 'G',    'Ҕ' => 'G',    'Һ' => 'H',    'Д' => 'D',
		'Ђ' => 'D',    'Е' => 'E',    'Ӗ' => 'YO',   'Ё' => 'YO',
		'Є' => 'YO',   'Ж' => 'J',    'Җ' => 'J',    'Ӝ' => 'J',
		'Ӂ' => 'J',    'З' => 'Z',    'Ӟ' => 'Z',    'Ӡ' => 'Z',
		'Ѕ' => 'Z',    'И' => 'I',    'Ӣ' => 'Y',    'Ӥ' => 'Y',
		'Й' => 'Y',    'І' => 'I',    'Ї' => 'I',    'Ј' => 'J',
		'К' => 'K',    'Ќ' => 'K',    'Ӄ' => 'K',    'Ҝ' => 'K',
		'Ҡ' => 'K',    'Ҟ' => 'K',    'Қ' => 'K',    'Ԛ' => 'Q',
		'Л' => 'L',    'Љ' => 'L',    'Ԡ' => 'L',    'М' => 'M',
		'Н' => 'N',    'Њ' => 'N',    'Ң' => 'N',    'Ӊ' => 'N',
		'Ҥ' => 'N',    'Ԋ' => 'N',    'Ԣ' => 'N',    'Ӈ' => 'N',
		'О' => 'O',    'Ӧ' => 'O',    'Ө' => 'O',    'Ӫ' => 'O',
		'Ҩ' => 'O',    'Œ' => 'O',    'П' => 'P',    'Ҧ' => 'P',
		'Ԥ' => 'P',    'Р' => 'R',    'С' => 'S',    'Ҫ' => 'S',
		'Т' => 'T',    'Ћ' => 'C',    'Ԏ' => 'T',    'Ҭ' => 'T',
		'У' => 'U',    'Ӱ' => 'U',    'Ӯ' => 'U',    'Ў' => 'U',
		'Ӳ' => 'U',    'Ү' => 'U',    'Ұ' => 'U',    'Ӏ' => 'L',
		'Ԝ' => 'W',    'Ф' => 'F',    'Х' => 'H',    'Ҳ' => 'H',
		'Ц' => 'C',    'Ҵ' => 'C',    'Џ' => 'D',    'Ч' => 'CH',
		'Ҷ' => 'CH',   'Ӌ' => 'CH',   'Ӵ' => 'CH',   'Ҹ' => 'CH',
		'Ҽ' => 'C',    'Ҿ' => 'C',    'Ш' => 'SH',   'Щ' => 'SCH',
		'Ъ' => '',     'Ы' => 'Y',    'Ӹ' => 'Y',    'Ь' => '',
		'Э' => 'E',    'Ә' => 'A',    'Ӛ' => 'A',    'Ю' => 'YU',
		'Я' => 'YA',   'Ґ' => 'G',    'Ѣ' => 'E',    'Ѫ' => 'A',
		'Ѳ' => 'F',    'Ѵ' => 'Y',

		'Α' => 'A',    'Ά' => 'A',    'Β' => 'V',    'Γ' => 'G',
		'Δ' => 'D',    'Ε' => 'E',    'Έ' => 'E',    'Ζ' => 'Z',
		'Η' => 'I',    'Ή' => 'I',    'Θ' => 'Th',   'Ι' => 'I',
		'Ί' => 'I',    'Ϊ' => 'I',    'ΐ' => 'I',    'Κ' => 'K',
		'Λ' => 'L',    'Μ' => 'M',    'Ν' => 'N',    'Ξ' => 'X',
		'Ο' => 'O',    'Ό' => 'O',    'Π' => 'P',    'Ρ' => 'R',
		'Σ' => 'S',    'Τ' => 'T',    'Υ' => 'Y',    'Ύ' => 'Y',
		'Ϋ' => 'Y',    'ΰ' => 'Y',    'Φ' => 'F',    'Χ' => 'CH',
		'Ψ' => 'PS',   'Ω' => 'O',    'Ώ' => 'Ó',

		'№' => '#',
	];

	return strtr($str, $converter);
}